update README with new architecture diagram
Updated project architecture diagram and description.
